// How to change the const value

const money = 100;
const rich = money + 1000;
// console.log(rich); // 1100
// console.log(money); // 100  

// যদিও const ভেরিয়েবল ডিক্লেয়ার করলে সেটার পুরো মান চেঞ্জ করা যয় না। তবে ভেরিয়েবল এর মান যদি অ্যারে বা অবজেক্ট হয়, তাহলে তার ভেতরের উপাদান বা পোপার্টি চেঞ্জ করা যায়। যেমনঃ

const numbers = [1, 2, 3, 4, 5];
numbers[1] = 10; // অ্যারে এর ভেতরের উপাদান চেঞ্জ করা হয়েছে
// console.log(numbers); // [1, 10, 3, 4, 5]   

// push pop

const numbers2 = [1, 2, 3, 4, 5];
numbers2.push(6, 10, 20); // অ্যারে এর শেষে নতুন উপাদান যোগ করা হয়েছে
numbers2[0] = 51;
// console.log(numbers2); // [51, 2, 3, 4, 5, 6, 10, 20]


// অবজেক্ট এর ক্ষেত্রেও একই নিয়ম প্রযোজ্য

const person = {
    name: 'John',
    age: 30
};
person.age = 31; // অবজেক্ট এর পোপার্টি চেঞ্জ করা হয়েছে
// console.log(person); // { name: 'John', age: 31 }  

// Default Friend Zone

function add(num1, num2){
    const result = num1 + num2;
    return result;      
};
const sum = add(10, 20);
// console.log(sum); // 30  


function add(num1, num2=0){
    const result = num1 + num2;
    return result;      
};
const sum2 = add(10);
// console.log(sum2);

// কিছু ডিফল্ট মানের উধারণ

// ০১. যোগ করলে সংখ্যা  টাইপ প্যারামিটা হলে ডিফল্ট মান  0 হতে পারে।
// ০২. স্ট্রিং টাইপ প্যারামিটা হলে ডিফল্ট মান '' হতে পারে।
// ০৩. অবজেক্ট টাইপ প্যারামিটা হলে ডিফল্ট মান {} হতে পারে।
// ০৪. অ্যারে টাইপ প্যারামিটা হলে ডিফল্ট মান [] হতে পারে।   
// ০৫. ফাংশন টাইপ প্যারামিটা হলে ডিফল্ট মান () => {} হতে পারে।
// ০৬. বুলিয়ান টাইপ প্যারামিটা হলে ডিফল্ট মান false হতে পারে।   
// ০৭. নাল টাইপ প্যারামিটা হলে ডিফল্ট মান null হতে পারে।
// ০৮. আনডিফাইন্ড টাইপ প্যারামিটা হলে ডিফল্ট মান undefined হতে পারে।
// ০৯. সিম্বল টাইপ প্যারামিটা হলে ডিফল্ট মান Symbol() হতে পারে।
// ১০. বিগিন্ট টাইপ প্যারামিটা হলে ডিফল্ট মান BigInt(0) হতে পারে।
// ১১. ক্লাস টাইপ প্যারামিটা হলে ডিফল্ট মান new ClassName() হতে পারে।
// ১২. ডেট টাইপ প্যারামিটা হলে ডিফল্ট মান new Date() হতে পারে।
// ১৩. গুণ বা ভাগ করলে ডিফল্ট মান 1 হতে পারে।
